# 포켓몬 게임
# Reference : 포켓몬스터dp - 사천왕 + 챔피언



# 전체적인 흐름
#
# 1. 게임 시작
#   1) 1. Start 2. Quit   선택지에서 1 입력 시 게임 시작, 2 입력 시 게임 종료
#
#   2) 플레이어 이름 입력
#
# 2. 포켓몬 선택
#   1) 만나게 될 적 이름 출력 (+ 적 포켓몬 info 제공할지?)
#
#   2) 타입 골고루 10 ~ 12가지 포켓몬 중 6마리 선택
#
# 3. 대화
#   1) 상대할 적과 간단한 대화 후 전투 진입
#
# 4. 전투
#   1) 적과의 전투 시작 (총 5회)
#
#   2-1) 승리 시 -> 상대할 적이 남았다면 2번 포켓몬 선택 단계로, 상대할 적이 없다면 축하 메시지 출력
#
#   2-2) 패배 시 -> 1. 다시 도전 2. 포기   선택지에서 1 입력 시 가장 최근 상대한 적과 재대결, 2 입력 시 게임 종료



# 필요 기능
#
# 1. UI
#   1) 진행을 위한 텍스트 메시지와 선택지
#
#   2) 전투 진입 시 행동 선택 화면
#       - 플레이어 남은 포켓몬 수
#         상대 남은 포켓몬 수
#       - 싸운다 -> 3-1) 으로
#       - 가방 ->
#       - 도망간다 -> 도망갈 수 없다는 메시지 출력
#       - 포켓몬 -> 포켓몬 교체(기절하지 않은 포켓몬만 가능)
#       - 추가내용 : 상성표
#
#   3-1) 싸운다 선택 시 화면
#       - 1.기술1  2.기술2  3.기술3  4.기술4  5.돌아간다   선택지에서 1 ~ 4 입력 시 선택한 번호의 스킬 발동, 5 입력 시 2) 화면으로 돌아가기
#
#   3-2) 가방 선택 시 화면
#       - 1.pp에이드(특정 포켓몬의 스킬 pp 5회복) 5개  2.회복약(hp 50회복) 10개  3.기력의 조각(기절한 포켓몬 부활 + hp 20회복) 3개  4.돌아간다
#       -   선택지에서 1 ~ 3 입력 시 선택한 번호의 아이템 사용, 4 입력 시 2) 화면으로 돌아가기
#       - 개수와 회복량은 밸런스에 따라 조정 가능

# 2. 포켓몬
#   1-1) 플레이어 포켓몬 종류
#       - 디아루가(타입 - 강철/드래곤, 약점 - 격투,땅, 강점 - 강철,노말,물,바위,벌레,비행,에스퍼,전기,풀(0.25배),독(무효), 기술 - 시간의포효,용의파동,화염방사,냉동빔)
#       - 뮤츠(타입 - 에스퍼, 약점 - 고스트,벌레,악, 강점 - 격투,에스퍼 기술 - HP회복,사이코키네시스,파동탄,냉동빔)
#       - 갸라도스(타입 - 비행/물, 약점 - 전기(4배), 강점 - 강철,격투,물,벌레,불꽃,땅(무효), 기술 - 폭포오르기,깨물어부수기,얼음엄니,용의춤)
#       - 로즈레이드(타입 - 독/풀, 약점 - 불꽃,비행,얼음,에스퍼, 강점 - 격투,물,전기,풀(0.25배), 기술 - 기가드레인,꽃잎댄스,오물폭탄,섀도볼)
#       - 한카리아스(타입 - 땅/드래곤, 약점 - 얼음(4배),드래곤, 강점 - 독,바위,불꽃,전기(무효), 기술 - 드래곤크루,지진,깨물어부수기,스톤에지)
#       - 피카츄(타입 - 전기, 약점 - 땅, 강점 - 전기,비행,강철, 기술 - 볼트태클,번개,아이언테일,전광석화)
#   1-2) 적 포켓몬 종류
#       - 총호 : 독케일(레벨 - 53, 타입 - 벌레/독, 약점 - 비행,바위,불꽃,에스퍼)
#               드래피온(레벨 - 57, 타입 - 독/악, 약점 - 땅)
#               헤라크로스(레벨 - 54, 타입 - 벌레/격투, 약점 - 비행(4배),불꽃,에스퍼)
#               비퀸(레벨 - 54, 타입 - 벌레/비행, 약점 - 비행,바위(4배),불꽃,전기,얼음)
#               뷰티플라이(레벨 - 53, 타입 - 벌레/비행, 약점 - 비행,바위(4배),불꽃,전기,얼음)
#               - 대체적으로 벌레 타입
#
#       - 들국화 : 누오(레벨 - 55, 타입 - 물/땅, 약점 - 풀)
#                 하마돈(레벨 - 59, 타입 - 땅, 약점 - 물,풀,얼음)
#                 딱구리(레벨 - 56, 타입 - 바위/땅, 약점 - 격투,땅,강철,물(4배),얼음)
#                 매깅(레벨 - 55, 타입 - 물/땅, 약점 - 풀)
#                 꼬지모(레벨 - 56, 타입 - 바위, 약점 - 격투,땅,강철,물,풀)
#                 - 대체적으로 땅 타입
#
#       - 대엽 : 날쌩마(레벨 - 58, 타입 - 불, 약점 - 땅,바위,물)
#               초염몽(레벨 - 61, 타입 - 불/격투, 약점 - 비행,땅,물,에스퍼)
#               이어롭(레벨 - 57, 타입 - 노말, 약점 - 격투)
#               강철톤(레벨 - 57, 타입 - 강철/땅, 약점 - 격투,땅,불꽃,물)
#               둥실라이드(레벨 - 58, 타입 - 고스트/비행, 약점 - 바위,고스트,전기,얼음,악)
#               - 대체적으로 불꽃 타입
#
#       - 오엽 : 마임맨(레벨 - 59, 타입 - 에스퍼, 약점 - 벌레, 고스트, 악)
#               요가램(레벨 - 60, 타입 - 격투/에스퍼, 약점 - 비행,고스트)
#               후딘(레벨 - 60, 타입 - 에스퍼, 약점 - 벌레,고스트,악)
#               동탁군(레벨 - 63, 타입 - 강철/에스퍼, 약점 - X)
#               키링키(레벨 - 59, 타입 - 노말/에스퍼, 약점 - 벌레,악)
#               - 대체적으로 에스퍼 타입
#
#       - 난천 : 화강돌(레벨 - 61, 타입 - 고스트/악, 약점 - X)
#               트리토돈(레벨 - 60, 타입 - 물/땅, 약점 - 풀(4배))
#               루카리오(레벨 - 63, 타입 - 격투/강철, 약점 - 격투,땅,불꽃)
#               한카리아스(레벨 - 66, 타입 - 드래곤/땅, 약점 - 얼음(4배),드래곤)
#               밀로틱(레벨 - 63, 타입 - 물, 약점 - 풀,전기)
#               로즈레이드(레벨 - 60, 타입 - 풀/독, 약점 - 비행,불꽃,에스퍼,얼음)
#
#   2) hp
#   - 모든 포켓몬의 hp를 100으로 고정
#
#   3) pp
#   - 레퍼런스를 따름
#
#   4) 속성
#   - 레퍼런스를 따름
#
#   5) 레벨
#   - 플레이어 포켓몬의 레벨은 60으로 고정
#   - 적 포켓몬의 레벨은 레퍼런스를 따름
#
#
#
#
#


class Pokemon() :
    def __init__(self, name):
        self.name = name

# 디아루가
#class Dialga(Pokemon) :




# 게임 시작
is_start = False
while True :
    start = int(input("게임을 시작하시겠습니까?\n1. 예     2. 아니오\n"))
    if start == 1 :
        is_start = True
        break
    elif start == 2 :
        print("게임이 종료되었습니다.")
        break
    else:
        print("잘못된 입력입니다")

# 플레이어 이름 입력
if is_start == True :
    player_name = input("플레이어 이름을 입력해주세요 : ")
    print(f"반갑습니다 {player_name}님! {player_name}님이 사용하실 포켓몬입니다.")

